; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v8 - type_3 ?v7 - type_1)
 	      (pred_3 ?v4 - object ?v7 - type_1)
	      (pred_4 ?v8 - type_3 ?v5 - type_2)
	      (pred_2 ?v8 - type_3 ?v4 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v8 - type_3 ?v1 ?v3 - type_1)
       :precondition (and  (pred_1 ?v8 ?v1))
       :effect (and  (pred_1 ?v8 ?v3)
		     (not (pred_1 ?v8 ?v1))))

   (:action op_3
       :parameters (?v8 - type_3 ?v6 - object ?v2 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v2) (pred_1 ?v8 ?v2) (pred_4 ?v8 ?v5))
       :effect (and (pred_2 ?v8 ?v6 ?v5)
		    (not (pred_3 ?v6 ?v2)) 
		    (not (pred_4 ?v8 ?v5))))

   (:action op_2
       :parameters (?v8 - type_3 ?v6 - object ?v2 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v6 ?v5) (pred_1 ?v8 ?v2))
       :effect (and (pred_3 ?v6 ?v2)
		    (pred_4 ?v8 ?v5)
		    (not (pred_2 ?v8 ?v6 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_13 obj_01 - type_3
obj_11 obj_10 obj_12 obj_07 - type_2
obj_09 obj_02 obj_04 obj_05 - type_1
obj_14 obj_06 obj_03 obj_08 - object)
(:init
(pred_1 obj_13 obj_05)
(pred_4 obj_13 obj_11)
(pred_4 obj_13 obj_10)
(pred_1 obj_01 obj_04)
(pred_4 obj_01 obj_12)
(pred_4 obj_01 obj_07)
(pred_3 obj_14 obj_04)
(pred_3 obj_06 obj_09)
(pred_3 obj_03 obj_02)
(pred_3 obj_08 obj_04)
)
(:goal
(and
(pred_3 obj_14 obj_05)
(pred_3 obj_06 obj_04)
(pred_3 obj_03 obj_04)
(pred_3 obj_08 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_13 obj_04)))
)
)

; plan
1. (op_1 obj_13 obj_05 obj_09)
   deleted: (pred_1 obj_13 obj_05)
   added: (pred_1 obj_13 obj_09)
   goals met: 0 of 4
2. (op_3 obj_01 obj_14 obj_04 obj_07)
   deleted: (pred_3 obj_14 obj_04) (pred_4 obj_01 obj_07)
   added: (pred_2 obj_01 obj_14 obj_07)
   goals met: 0 of 4
3. (op_1 obj_01 obj_04 obj_05)
   deleted: (pred_1 obj_01 obj_04)
   added: (pred_1 obj_01 obj_05)
   goals met: 0 of 4
4. (op_3 obj_13 obj_06 obj_09 obj_10)
   deleted: (pred_3 obj_06 obj_09) (pred_4 obj_13 obj_10)
   added: (pred_2 obj_13 obj_06 obj_10)
   goals met: 0 of 4
5. (op_2 obj_01 obj_14 obj_05 obj_07)
   deleted: (pred_2 obj_01 obj_14 obj_07)
   added: (pred_3 obj_14 obj_05) (pred_4 obj_01 obj_07)
   goals met: 1 of 4
6. (op_2 obj_13 obj_06 obj_09 obj_10)
   deleted: (pred_2 obj_13 obj_06 obj_10)
   added: (pred_3 obj_06 obj_09) (pred_4 obj_13 obj_10)
   goals met: 1 of 4
7. (op_1 obj_01 obj_05 obj_02)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_02)
   goals met: 1 of 4
8. (op_3 obj_01 obj_03 obj_02 obj_07)
   deleted: (pred_3 obj_03 obj_02) (pred_4 obj_01 obj_07)
   added: (pred_2 obj_01 obj_03 obj_07)
   goals met: 1 of 4
9. (op_1 obj_01 obj_02 obj_04)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_04)
   goals met: 1 of 4
10. (op_2 obj_01 obj_03 obj_04 obj_07)
   deleted: (pred_2 obj_01 obj_03 obj_07)
   added: (pred_3 obj_03 obj_04) (pred_4 obj_01 obj_07)
   goals met: 2 of 4
11. (op_3 obj_01 obj_08 obj_04 obj_07)
   deleted: (pred_3 obj_08 obj_04) (pred_4 obj_01 obj_07)
   added: (pred_2 obj_01 obj_08 obj_07)
   goals met: 2 of 4
12. (op_1 obj_01 obj_04 obj_09)
   deleted: (pred_1 obj_01 obj_04)
   added: (pred_1 obj_01 obj_09)
   goals met: 2 of 4
13. (op_2 obj_01 obj_08 obj_09 obj_07)
   deleted: (pred_2 obj_01 obj_08 obj_07)
   added: (pred_3 obj_08 obj_09) (pred_4 obj_01 obj_07)
   goals met: 3 of 4
14. (op_3 obj_01 obj_06 obj_09 obj_07)
   deleted: (pred_3 obj_06 obj_09) (pred_4 obj_01 obj_07)
   added: (pred_2 obj_01 obj_06 obj_07)
   goals met: 3 of 4
15. (op_1 obj_01 obj_09 obj_04)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_04)
   goals met: 3 of 4
16. (op_2 obj_01 obj_06 obj_04 obj_07)
   deleted: (pred_2 obj_01 obj_06 obj_07)
   added: (pred_3 obj_06 obj_04) (pred_4 obj_01 obj_07)
   goals met: 4 of 4
